// ========================
// 인기 해시태그 불러오기
// ========================
function 인기태그불러오기(){
    fetch('/api/hashtages/popular')
        .then(function(백엔드응답결과){
            if(!백엔드응답결과.ok) throw new Error("해시태그 백엔드에서 가져오기 실패 : ", 백엔드응답결과.status);
            return 백엔드응답결과.json(); // 문자열로 온 데이터들을 javascript 사용하는 json 형태로 변환해서 반환
        })
        .then(function (태그목록){
            태그목록렌더링(태그목록);
        })
        .catch(function (에러){
            console.error(에러);
        });
}

// ========================
// 인기 해시태그 검색
// ========================

// ========================
// 드롭다운 렌더링
// ========================

// ========================
// 드롭다운 열기 / 닫기
// ========================

// ========================
// 검색 실행
// ========================

// ========================
// 초기화
// ========================

